Catalogs/Секреты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Секреты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сейф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сейфы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТегиСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСекрета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСекретов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЛокальноеХранилище.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛокальноеХранилище</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗашифрованноеЗначение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Модифицированность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Секрет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секреты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСекретов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыСекретов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Локальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Секреты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаНаПубликацию.Ссылка КАК Ссылка
		|ИЗ
		|	БизнесПроцесс.ЗаявкаНаПубликацию КАК ЗаявкаНаПубликацию
		|ГДЕ
		|	Не ЗаявкаНаПубликацию.ПометкаУдаления
		|	И ЗаявкаНаПубликацию.Секрет = &Секрет
		|	И ЗаявкаНаПубликацию.Стартован
		|	И Не ЗаявкаНаПубликацию.Завершен";
	Запрос.УстановитьПараметр("Секрет", Объект.Ссылка);
	
	ЗапросЛокальноеХранилище = Новый Запрос;
	ЗапросЛокальноеХранилище.Текст =
		"ВЫБРАТЬ
		|	ЛокальноеХранилище.Модифицированность КАК Модифицированность
		|ИЗ
		|	РегистрСведений.ЛокальноеХранилище КАК ЛокальноеХранилище
		|ГДЕ
		|	ЛокальноеХранилище.Пользователь = &Пользователь
		|	И ЛокальноеХранилище.Секрет = &Секрет";
	ЗапросЛокальноеХранилище.УстановитьПараметр("Секрет", Объект.Ссылка);
	ЗапросЛокальноеХранилище.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	ВыборкаЛокальноеХранилище = ЗапросЛокальноеХранилище.Выполнить().Выбрать();
	ВыборкаЛокальноеХранилище.Следующий();
	
	Элементы.ФормаСоздатьЗаявкуНаПубликацию.Видимость = (Объект.ТипСекрета = Перечисления.ТипыСекретов.Локальный) 
		Или ВыборкаЛокальноеХранилище.Модифицированность = Истина;
	Элементы.ФормаСоздатьЗаявкуНаПубликацию.Доступность = Запрос.Выполнить().Пустой();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ТипСекрета = Перечисления.ТипыСекретов.Локальный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСекрет(Команда)
	Если Модифицированность Тогда
		Сообщить("Элемент необходимо записать");
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(МастерПарольКлиент.Получить()) Тогда
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Секрет", Объект.Ссылка);
		ПараметрыОткрытия.Вставить("ОткрытыйКлюч", МастерПарольКлиент.Получить());
		ПараметрыОткрытия.Вставить("ДоступноИзменение", ДоступноИзменение());
		ОткрытьФорму("Справочник.Секреты.Форма.ФормаДанныхСекрета", ПараметрыОткрытия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуНаПубликацию(Команда)
	Если Модифицированность Тогда
		Сообщить("Элемент необходимо записать");
		Возврат;
	КонецЕсли;
	Если Объект.Сейф = ПредопределенноеЗначение("Справочник.Сейфы.Личный") Тогда
		Сообщить("Нельзя публиковать секреты из личной папки");
		Возврат;
	КонецЕсли;
	СоздатьЗаявкуНаПубликациюНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявкуНаПубликациюНаСервере()
	Элементы.ФормаСоздатьЗаявкуНаПубликацию.Доступность = Ложь;
	БП = БизнесПроцессы.ЗаявкаНаПубликацию.СоздатьБизнесПроцесс();
	БП.Дата = ТекущаяДатаСеанса();
	БП.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	БП.Секрет = Объект.Ссылка;
	БП.Записать();
	БП.Старт();
	Сообщить("Стартован БП " + БП);
КонецПроцедуры

Функция ДоступноИзменение()
	Возврат Объект.ТипСекрета = ПредопределенноеЗначение("Перечисление.ТипыСекретов.Локальный") 
		Или РольДоступна(Метаданные.Роли.ИзменениеСекретов) 
		Или РольДоступна(Метаданные.Роли.ПолныеПрава);
КонецФункции
